// src/utils/flags.js
const flagMap = {
  'مکزیک': 'mx', 'آفریقای جنوبی': 'za', 'کره جنوبی': 'kr', 'جمهوری چک': 'cz',
  'بوسنی و هرزگوین': 'ba', 'کانادا': 'ca', 'استرالیا': 'au', 'ترکیه': 'tr',
  'آلمان': 'de', 'کوراسائو': 'cw', 'هلند': 'nl', 'ژاپن': 'jp',
  'ساحل عاج': 'ci', 'اکوادور': 'ec', 'سوئد': 'se', 'تونس': 'tn',
  'اسپانیا': 'es', 'کیپ ورد': 'cv', 'بلژیک': 'be', 'مصر': 'eg',
  'عربستان': 'sa', 'اروگوئه': 'uy', 'فرانسه': 'fr', 'سنگال': 'sn',
  'عراق': 'iq', 'نروژ': 'no', 'اتریش': 'at', 'اردن': 'jo',
  'انگلیس': 'gb-eng', 'کرواسی': 'hr', 'غنا': 'gh', 'پاناما': 'pa',
  'پرتغال': 'pt', 'کنگو': 'cd', 'ازبکستان': 'uz', 'کلمبیا': 'co',
  'برزیل': 'br', 'مراکش': 'ma', 'قطر': 'qa', 'سوئیس': 'ch',
  'ایران': 'ir', 'نیوزیلند': 'nz', 'آرژانتین': 'ar', 'الجزایر': 'dz',
  'آمریکا': 'us', 'پاراگوئه': 'py', 'هائیتی': 'ht', 'اسکاتلند': 'gb-sct'
};

export const getFlagUrl = (teamName) => {
  const code = flagMap[teamName];
  return code ? `https://flagcdn.com/w40/${code}.png` : null;
};